Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/R01.tmx
Source language: en_us
Languages: zh_cn

source: Big Hand Print
zh_cn: 大手印

source: This man, Bill Lexx, as I was about to find out, was standing in front of the third story men's bathroom window when I went to use it this morning. Outside the window, not inside the bathroom, but on the outside, in a suit, which I might add was not a three-piece, and he had taken his tie off; his socks didn't match the color of his suit.
zh_cn: 今天早上我去上厕所的时候，将会发现这个男人，比尔·勒克斯斯（Bill Lexx），正站在三楼男厕所的窗户前面，是在窗户外面，不是在厕所里面，而是在外面。他穿着一套西装，这我可以补充说一下，不是三件套，他还解下了领带；他的袜子与他西装的颜色不搭配。

source: I only noticed that because I sit down when I pee.
zh_cn: 我只注意到了这一点，因为我是坐下撒尿的。

source: I know a lot of men don't do that, or would never admit it, but I do.
zh_cn: 我知道很多男人不这样做，或从不承认，但我是这样做的。

source: My grandmother taught me it was impolite to be heard using the bathroom, period.
zh_cn: 我祖母教育我用厕所时被听到是不礼貌的，好了，不说了。

source: So, I'm sitting on the toilet, and this man, Bill, I guess he heard me, because I had to put the toilet seat down, you know, so I could sit on it, and it clanged against the porcelain base of the toilet.
zh_cn: 总之，我坐在马桶上，而这个男人，比尔，我想他听到我了，因为我必须放下马桶座圈，你知道的，以便我坐在上面，它咣当一声落在马桶的陶瓷底座上。

source: And he turns around and stares at me.
zh_cn: 他转过头盯着我看。

source: Thank God I hadn't taken my pants off yet.
zh_cn: 谢天谢地我还没脱下裤子。

source: I'd sat down on the toilet to retie my shoes.
zh_cn: 我正坐在马桶上系鞋带。

source: I forgot to mention that.
zh_cn: 我忘了提这事儿。

source: See, Margie, the secretary in my office, made me untie my shoes when she was getting off the elevator.
zh_cn: 你看，玛吉（Margie），我办公室的那个秘书，在她出电梯时使我松开了鞋带。

source: I mean, accidentally, made me untie them.
zh_cn: 我的意思是，意外地使我松开了鞋带。

source: She goes down to the basement to smoke instead of outside, says she can't completely appreciate a cigarette outside.
zh_cn: 她下去到地下室吸烟，而不是到外面，她说她在外面不能够充分品味香烟。

source: I had walked a little past the elevator, not meaning to not speak, and then felt guilty and didn't want to be rude so I turned around to speak, and in the process of turning around, I stepped on my left shoestring.
zh_cn: 我已经走过电梯有一点儿了，不是有意不说话的，然后觉得心虚，不想没礼貌，所以我转过身说话，在转身的过程中，我踩到了我左脚的鞋带。

source: She couldn't have cared less.
zh_cn: 她根本就不在意。

source: The elevator doors shut.
zh_cn: 电梯门关上了。

source: So, I took the stairs up to the next floor to go to the bathroom.
zh_cn: 所以，我爬楼梯到上面一层去上厕所。

source: The bathrooms weren't designed with common sense in mind, just the safety of each gender.
zh_cn: 厕所设计得很没常识，只考虑到每个性别的安全。

source: The building itself has only had one renovation, and that was out of necessity due to Camille, back in 1969.
zh_cn: 大楼本身只在1969年整修过一次，据卡米尔（Camille）说那还是出于必需不得已的。

source: Nothing else has ever been done to alter its appearance, not even for convenience.
zh_cn: 没有做过其他任何事来改变它的外观，即使为了便利设施也没做过。

source: It found its way onto the National Registry, about a hundred years after it housed Confederate soldiers; now, it exists to depreciate history.
zh_cn: 在给南方联盟军士兵提供住房大约一百年后，它找到了通往国家注册局的路；现在，它继续存在着来藐视历史。

source: The men's bathrooms are on every other floor.
zh_cn: 每隔一层楼有男厕所。

source: And right as I got to the third floor, I saw Mr. Yola and got nervous.
zh_cn: 就在我到达三楼时，看到了约拉（Yola）先生，我紧张起来。

source: That's how my other shoe got untied because I stepped on my right shoestring when I saw him, but I couldn't stop right then to tie either of them back because I thought Yola had seen me, and even though I was just going to the bathroom, he'd find some way to make me feel guilty for it.
zh_cn: 就这样我的另一只鞋的鞋带松了，因为看到他时我踩到了我右脚上的鞋带，但我不能在那个时侯停下来系其中任一只鞋带，因为我想约拉已经看到我了，即使我正要去厕所，他还是会有办法让我感到心虚。

source: He's now the number one man at the Shipping office, and has been since Mr. Leman was found dead floating around Lake Tia O'Khata, last July.
zh_cn: 他现在是运输事务所的头号人物，自从去年七月莱曼（Leman）先生的尸体被发现漂浮在提亚·欧卡塔湖（Lake Tia O'Khata）上后他一直都是。

source: Yola's a true Mississippi gentleman; he doesn't have any children.
zh_cn: 约拉是一个真正的密西西比绅士；他没有孩子。

source: He was mumbling to himself and had a rather glossed look to his face; I just went on to the bathroom, and sat down on the toilet to tie my shoes.
zh_cn: 他正在咕哝着自言自语，脸上红光焕发；我只有继续向厕所走去，在马桶上坐下来系鞋带。

source: And I don't know what I was thinking.
zh_cn: 我不知道我在想什么。

source: But after I tied my shoes, and this man, Bill, you know, is still staring at me- I told him his socks didn't match his suit.
zh_cn: 但是在我系好鞋带后，这个男人，比尔，你知道的，还在盯着我看——我告诉他他的袜子和他的西装不搭。

source: "What?" Bill mouthed.
zh_cn: “什么？”比尔用口型说。

source: He couldn't hear me; the window was closed.
zh_cn: 他听不见我说话；窗户是关上的。

source: I got up and opened the window...however, it's that old kind of window that opens out instead of raises up, so I had to ask him, I had to raise my voice, to scoot over to the left a little bit so I could push the window out.
zh_cn: 我站起来去开窗户，可是，这窗户是那种旧式的向外开的，不是向上提拉的，所以我不得不要他——我还必须得提高声音说话——向左挪一点，以便我能把窗户推出去。

source: "What!?"tried not to raise my voice, first, and mouthed back at him, instead.
zh_cn: “什么！？”一开始我试着不提高声音，而是用口型回答他。

source: You know like you do when you're in a car and you're talking to someone else in another car, like at a stoplight, and maybe you know them.
zh_cn: 你知道的，就像你在车里跟另外一辆车里的人说话那样，比如说在等红灯时，或许你知道这些。

source: "Scoot over to the left.
zh_cn: “向左挪一下。

source: I cannot open the window.
zh_cn: 我不能开窗。

source: It opens out, not up."
zh_cn: 它是向外开的，不是向上。”

source: I motioned with my arms to indicate what I was asking him to do.
zh_cn: 我用胳膊比划着来说明我要他做什么。

source: After a second or two, he caught on.
zh_cn: 一两秒钟后，他明白了。

source: I pushed the window out, and then we had another problem.
zh_cn: 我把窗户推出去了，然后我们有了另外一个问题。

source: The window got stuck.
zh_cn: 窗户卡住了。

source: See, the windows are tall, and they're plain glass, by the way, not frosted like in the ladies' which all bathroom windows should be, and when I pushed them open, they split, you know, one went out to the right and the other to the left.
zh_cn: 你看，窗户很高，还是普通玻璃的，顺便说一下，不是像女厕所那样磨砂的，所有厕所窗户都应该是那样的。当我把它们推开时，它们分开了，你知道的，一扇向右开，另一扇向左开。

source: And the left one, on Bill's side, got stuck.
zh_cn: 左边那扇，在比尔的旁边，卡住了。

source: I did try to close it back when I realized he couldn't then step around it, but it wouldn't budge.
zh_cn: 当我意识到这样他就不能绕过来的时候，我确实试图再把它关回来，但它动不了了。

source: If the left window had gone all the way back to the wall of the building, he could have gotten around the window and crawled back into the bathroom.
zh_cn: 如果左扇窗户原路返回到大楼的墙壁处，他就能绕过窗户爬回到厕所里。

source: But, as it was, he couldn't move, and the men's bathroom on the third floor is the last room on that floor, on the east side of the building.
zh_cn: 但是，照现在这样，他不能动了，而三楼的男厕所是这层楼的最后一个房间，在大楼的东边。

source: Basically, he was trapped.
zh_cn: 总的来说，他被困住了。

source: There wasn't any other window for him to go to.
zh_cn: 没有其他窗户可以让他进来。

source: I forgot all about peeing.
zh_cn: 我完全忘了撒尿。

source: I leaned out the window, and looked through the glass at him.
zh_cn: 我探身伸出窗口，透过玻璃看着他。

source: "Hey!
zh_cn: “嘿！

source: I was just trying to tell you your socks...didn't match...your... suit."
zh_cn: 我只是要告诉你你的袜子和西装不搭。”

source: I don't know what the hell I was thinking.
zh_cn: 我不知道我他妈的到底在想什么。

source: Then, you know what he did; he started to cry.
zh_cn: 然后，你知道他做了什么；他开始哭。

source: And I don't mean simple crying, I mean deep crying- drool was stringing down from the sides of his lips, cutting off into drops- falling the length of three floors.
zh_cn: 我的意思不是指单纯的哭泣，我是指嚎啕大哭——口水从他唇边流下，断成点点滴滴——从三层楼的高度落下。

source: I can't believe I told him his socks didn't match.
zh_cn: 我真不能相信我跟他说了他的袜子不搭。

source: Eight minutes ago, Mr. Yola fired Bill, without remorse, without regret.
zh_cn: 八分钟前，约拉先生炒了比尔，毫不留情，毫不惋惜。

source: I'd passed him, Yola, on his way back from Bill's office, apparently.
zh_cn: 我从他身边经过，约拉是在从比尔的办公室回来的路上，显然是的。

source: The things I wouldn't have known if I hadn't gone to the bathroom, huh?
zh_cn: 如果我没去上厕所，我就不会知道这些事，对吧？

source: Bill Lexx (and he was very exact with this, methodical) said it took him six and a half minutes to climb out of the break-room window and around to this side of the building.
zh_cn: 比尔·勒克斯斯（他对此非常严谨，有板有眼的）说他用了六分半钟从休息室的窗户爬出来再转到大楼的这一边。

source: He took two steps a minute, precisely, except at the corner.
zh_cn: 除了在转角处，他正好每分钟挪两步。

source: Bill Lexx was very thorough about this process; I imagine he's rather good at his job: an accountant.
zh_cn: 比尔·勒克斯斯对这一过程描述得很详尽；我想他对自己的工作相当擅长：一个会计。

source: Or, you know, used to be.
zh_cn: 或者，你知道的，曾经是一个会计。

source: He was also very anxious to explain himself.
zh_cn: 他也很急于为自己辩解。

source: Of course, this side of the building faced the executive parking lot.
zh_cn: 当然了，大楼的这一边面向管理部门的停车场。

source: I didn't know why that was important, at first.
zh_cn: 我一开始不明白为什么这一点很重要。

source: Bill Lexx's wife is pregnant with twins.
zh_cn: 比尔·勒克斯斯的妻子正怀着一对双胞胎。

source: She doesn't have a job.
zh_cn: 她没有工作。

source: Bill had a wonderful health plan through the company.
zh_cn: 比尔在公司里有极好的发展计划。

source: Two months away from five years in the same position.
zh_cn: 还有两个月就在同一个职位上做了五年了。

source: Raises usually start around then.
zh_cn: 升迁通常都在这前后开始。

source: It was the perfect job for a man of exactitude, as he seemed to be.
zh_cn: 对于一个严谨的人来说，那是一个完美的工作，他看上去也像是这样一个人。

source: Bill says he has no idea what happened to the money.
zh_cn: 比尔说他不知道那笔钱出了什么事。

source: I believe him.
zh_cn: 我相信他。

source: Then, again, the tears.
zh_cn: 然后，他又一次流泪了。

source: "I signed the papers, I signed off on them, the papers...I know that it it it it it came to the office.
zh_cn: “我签了那些文件，我在上面签了字，文件知道它它它它去了办公室。

source: Alicia knows.... She can...she she...she'll tell you that!!"
zh_cn: 艾丽西亚（Alicia）知道？她能她她她会告诉你的！！”

source: Margie may smoke, but at least she's efficient.
zh_cn: 尽管玛吉抽烟，但至少她挺能干的。

source: But, then, I didn't really know Alicia, other than she'd worn a cotton antler headband with bells on them, at the last three Christmas parties.
zh_cn: 不过话说回来，我对艾丽西亚真的不了解，除了在过去三年的圣诞晚会上她都戴着一个带有铃铛的棉制鹿角束发带。

source: It must have been a large amount of money.
zh_cn: 那肯定是一大笔钱。

source: I looked down below us.
zh_cn: 我朝我们下面看去。

source: You know, three stories is not all that high.
zh_cn: 你知道的，三层楼不是那么高的。

source: I mean it's not so high that people can't notice you, especially when you're standing on the ledge outside of the building.
zh_cn: 我的意思是它还没有高到人们注意不到你的地步，尤其是当你站在大楼外面的窗台上时。

source: But nobody even looked at us; none of the people walking by paid any attention.
zh_cn: 但是甚至都没人看我们；走过的人中没有人注意到。

source: He quit crying.
zh_cn: 他停止了哭泣。

source: And, then, Bill Lexx asked me to forgive him.
zh_cn: 然后，比尔·勒克斯斯请我原谅他。

source: "Tell me you forgive me!"
zh_cn: “跟我说你原谅我！”

source: He was becoming irrational.
zh_cn: 他变得不理智。

source: So, I told him.
zh_cn: 所以，我跟他说了。

source: "I forgive you."
zh_cn: “我原谅你。”

source: What harm could it do?
zh_cn: 这能有什么害处？

source: If it helped him to realize what he was doing, if it helped him think rationally, you know, why not, I'd do it.
zh_cn: 如果这能帮他意识到他正在做什么，如果这能帮他理性思考，你知道的，为什么不呢，我会做的。

source: I mean, I did it.
zh_cn: 我的意思是，我做了。

source: Maybe in a bizarre way I was speaking for the company, you know, to him.
zh_cn: 或许我是以一种奇特的方式代公司跟他说的，你知道的。

source: I don't know.
zh_cn: 我不知道。

source: At the same time, and it hit me all of a sudden, it...it seemed an enormous responsibility for me to forgive this man.
zh_cn: 但是，我突然间想到了，原谅这个人对我来说好像是一项巨大的责任。

source: You know, when I first came to work here, the Crisis Management Team, from Community Counseling- their offices are across the street in the Bancorp South building- was hired by this company to conduct a seminar on "Suicidal Tendencies in the Workforce."
zh_cn: 你知道，当我开始来这里工作时，来自社区咨询——他们的办公室在街对面的合众银行（Bancorp）南楼——的危机管理小组被这家公司请来进行一个关于“员工中的自杀倾向”的研讨会。

source: I didn't go.
zh_cn: 我没去。

source: I didn't have suicidal tendencies.
zh_cn: 我没有自杀倾向。

source: I don't think outside the box very well, I guess.
zh_cn: 我没有跳出固定模式来思考，我想。

source: "Bill, I know you haven't mentioned jumping off, from, from here, and I am hoping it's because you are changing your mind if that was your original intention."
zh_cn: “比尔，我知道你没提到要从、从这里跳下去，我希望是因为你改了主意，如果你原先是那样打算的话。”

source: "I, I....I just, I..." He stuttered.
zh_cn: “我，我？我只是，我？”他结结巴巴地说。

source: I waited for more.
zh_cn: 我等他说下去。

source: There was no more.
zh_cn: 他没再说了。

source: He just stood still.
zh_cn: 他只是静静地站着。

source: I couldn't help but feel frustrated.
zh_cn: 我不由得感到沮丧。

source: Then, he started sobbing again.
zh_cn: 这时，他又开始哭了。

source: "Your wife is pregnant, Bill!
zh_cn: “你妻子怀孕了，比尔！

source: You can't forget about that!
zh_cn: 你不能忘了这事儿！

source: She needs you; those babies will need you!
zh_cn: 她需要你；孩子们也会需要你！

source: So you lost your job.
zh_cn: 你是丢了工作。

source: You'll get another one!"
zh_cn: 你会再找到一个的！”

source: I didn't believe that myself.
zh_cn: 这话我自己也不相信。

source: It's hard to come back from being fired.
zh_cn: 被炒了再回来是很难的。

source: He got so mad he hit the window.
zh_cn: 他变得很疯狂，猛力击打窗户。

source: Glass splintered everywhere, down to the ground and all over the ledge.
zh_cn: 玻璃碎得到处都是，落在地上，窗台上都是。

source: Then, I peed my pants.
zh_cn: 然后，我尿了裤子。

source: I have a fear of ingesting glass; my father was an alcoholic.
zh_cn: 我很怕吃到玻璃；我父亲是个酒鬼。

source: Thank God none of the glass hit me.
zh_cn: 谢天谢地没有玻璃打到我。

source: This would have been a lot worse if we'd been in a kitchen, I thought, Be glad we're not in a kitchen.
zh_cn: 假如我们是在厨房里情况要糟得多，我想，很高兴我们不是在厨房里。

source: His hand was bleeding, naturally.
zh_cn: 不用说他的手在流血。

source: I ran to the sink, to the towel dispenser and ripped out one of those big rolls of brown paper towels that seem to thrive in industrial buildings.
zh_cn: 我跑向水池，跑向纸巾机，用力扯出一卷那些大卷的棕色纸巾（这种东西在工业大楼里貌似很红火）。

source: God, I bet that company makes some money.
zh_cn: 天啊，我打赌那家公司赚了些钱。

source: Maybe they were hiring.
zh_cn: 或许他们在招人。

source: I tried to tear off a large sheet of it, but Bill Lexx reached through the broken window, grabbed that whole roll and threw it straight to the ground.
zh_cn: 我试图撕下一大张，但比尔·勒克斯斯从破了的窗户伸手进来，抓走了那一整卷，然后直接扔到地上。

source: He didn't seem to care that he had glass stuck in his hand, a few brittle shards embedded around his knuckles.
zh_cn: 他好像不在乎他手上扎进了玻璃，他指关节周围嵌进了几片尖利的碎片。

source: "Bill. Come inside. Please.
zh_cn: “比尔，进来吧，求你了。

source: Don't jump.
zh_cn: 别跳。

source: I mean, look, look!
zh_cn: 我是说，你看，你看！

source: You popped out the glass, you can crawl through, at least...I can get an ambulance...the hospital's only a block or..."
zh_cn: 你打破了玻璃，你可以爬过来了，至少你可以叫到一辆救护车，医院只有一个街区”

source: "Shut the hell up.
zh_cn: “闭上你丫的嘴。

source: Shut up. Shut up. Shut up. Shut up."
zh_cn: 闭嘴，闭嘴，闭嘴，闭嘴。”

source: And I'm thinking it's amazing that not one single man has walked into this bathroom yet.
zh_cn: 而我在想，到现在还没有一个人走进这间厕所真是奇怪。

source: We must have some powerful bladders in this building.
zh_cn: 在这座楼里一定有些人拥有强大的膀胱。

source: I was actually starting to get pissed off, you know?
zh_cn: 实际上我开始恼火了，你知道吗？

source: Why did I have to deal with this?
zh_cn: 为什么我非得应付这件事？

source: I wasn't all that close to Bill Lexx; we don't even work in the same department.
zh_cn: 我和比尔·勒克斯斯的关系也没那么亲近；我们甚至都不在同一个部门工作。

source: God, why did I even look at his damn socks.
zh_cn: 天啊，为什么我恰好看他那该死的袜子呢？

source: Still, I was in the middle of it now.
zh_cn: 不过，我现在仍然深陷其中。

source: Here I was petitioning for an arbitrary man's life, rallying for his unborn twins and pitiful wife, for his seemingly indiscriminate purpose for living.
zh_cn: 此时我正在为一个任性男人的生命祈求，为他未出生的双胞胎和可怜的妻子鼓劲，为他看似混乱的生存意志打气。

source: Bill stopped crying and stood up.
zh_cn: 比尔停止了哭泣，站了起来。

source: He had alternated half-stand to crouch for most of his confessional.
zh_cn: 在他自白的大部分时间里他轮换着或半站立或蹲下。

source: He was bleeding all over his suit, it was navy, a polyester blend, and the empty window frame.
zh_cn: 他的血流得他西装上到处都是（他的西装是深蓝色的，聚酯混纺的），还有空空的窗框上也是。

source: He put his hand on the brick wall of the building, preparing to fully stand, I thought.
zh_cn: 他将手放在大楼的砖墙上，我想他是准备要完全站起来。

source: His hand had such a large spread.
zh_cn: 他的手张开来的幅度有那么大。

source: His shoulders relaxed, and he leaned against the wall, standing straight up.
zh_cn: 他的肩部放松，靠在墙上，直立着。

source: He must have been over six feet tall.
zh_cn: 他身高肯定超过了六英尺。

source: I guess that's how I saw his socks to begin with; his pants didn't quite fit the length of his legs.
zh_cn: 我想那就是为什么我一开始看到了他的袜子；他的裤子不怎么适合他腿的长度。
